## Q1. List any five functions of the pandas library with execution.

# Ans:1 

**1.'read_csv':** This function is used to read a CSV file and create a DataFrame object.

In [1]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

**2.head():** This function is used to return the first n rows of a DataFrame.

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

**3.info():** This function is used to print a concise summary of a DataFrame, including the data type of each column and the number of non-null values.

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

**4.groupby():** This function is used to group data based on one or more columns and apply an aggregate function to the groups.

In [4]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
g = df.groupby('Survived')
g.sum()

/tmp/ipykernel_168/3271506617.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  g.sum()

          PassengerId  Pclass       Age  SibSp  Parch        Fare
Survived
0              245412    1390  12985.50    304    181  12142.7199
1              151974     667   8219.67    162    159  16551.2294

**5.merge():** This function is used to merge two DataFrames based on a common column.

In [5]:
data1 = pd.DataFrame({'key1' : [1,34,3,4,15,6],
                      'key4' : [4,5,6,7,68,9],
                      'key5' : [3,455,6,7,88,22]
})

data2 = pd.DataFrame({'key1' : [3,4,5,6,7],
     'key2' : [5,6,7,9,8],
     'key3' : [4,5,6,7,8]
}) 

g1 = pd.merge(data1, data2)
g1

   key1  key4  key5  key2  key3
0     3     6     6     5     4
1     4     7     7     6     5
2     6     9    22     9     7

## Q2.Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
# Ans: 2

def reindex_dataframe(df):
    new_index = pd.Index(range(1, len(df)*2, 2))  # create a new index starting from 1 and incrementing by 2
    df = df.set_index(new_index)  # set the new index on the DataFrame
    return df

In [7]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

new_df = reindex_dataframe(df)
print(new_df)

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [9]:
# Ans: 3


def sum_first_three(df):
    sum = 0 
    for i in range(3):
        sum += df['Values'][i]
    print("Sum of the first three values in 'Values' column:", sum)
    
    
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})
print(df) 
sum_first_three(df)

   Values
0      10
1      20
2      30
3      40
4      50
Sum of the first three values in 'Values' column: 60

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [11]:
# Ans:4 

df = pd.DataFrame({'Text' :['Hello team PWskills', 'I am krishna kumar from IMPACT BATCH 2.0', 'PWskills is providing such great course in a very very afordable price']})

def add_word_count(df):
    df['Word_count'] = df['Text'].apply(lambda x : len(str(x).split()))
    return df

df = add_word_count(df)
df = pd.DataFrame(df)
df

                                                Text  Word_count
0                                Hello team PWskills           3
1           I am krishna kumar from IMPACT BATCH 2.0           8
2  PWskills is providing such great course in a v...          12

## Q5. How are DataFrame.size() and DataFrame.shape() different?

# Ans: 5 

DataFrame.size and DataFrame.shape are both methods in Pandas that can be used to obtain information about the size and shape of a DataFrame, but they provide different information.

**DataFrame.size** returns the total number of elements in the DataFrame, which is equal to the number of rows multiplied by the number of columns. It does not provide any information about the shape of the DataFrame, only the total number of elements.

On the other hand, **DataFrame.shape** returns a tuple containing the number of rows and columns in the DataFrame. For example, if a DataFrame has 5 rows and 3 columns, DataFrame.shape will return the tuple (5, 3). This provides information about the shape of the DataFrame, which can be useful for understanding the structure of the data.

In [12]:
#Here is an example;
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})
print('DataFrame size :' , df.size)
print('DataFrame shape:' , df.shape)

DataFrame size : 9
DataFrame shape: (3, 3)

## Q6. Which function of pandas do we use to read an excel file?

# Ans: 6

In Pandas, we use the **read_excel()** function to read an Excel file. This function is part of the pandas module and can read Excel files in various formats including .xls, .xlsx, and .xlsm.
read_excel() has many optional parameters that you can use to specify the sheet name, header row, data types, and other options when reading the Excel file. You can refer to the Pandas documentation for more information on these parameters.

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [14]:
# Ans: 7

def extract_username(df):
    username = df['Email'].str.split('@', expand=True)[0]
    df['Username'] = username
    return df

df = pd.DataFrame({'Email' : ['krish@gmail.com' , 'sudh121@gmail.com' , 'alakhpanday07@gmail.com' , 'krishnakumar@gmail.com' , 'mohalstar111@gmail.com']})

df = extract_username(df)
df = pd.DataFrame(df)
df.head()

                     Email       Username
0          krish@gmail.com          krish
1        sudh121@gmail.com        sudh121
2  alakhpanday07@gmail.com  alakhpanday07
3   krishnakumar@gmail.com   krishnakumar
4   mohalstar111@gmail.com   mohalstar111

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

## Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
## The function should return a new DataFrame that contains only the selected rows.

In [15]:
# Ans: 8 

def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10 )]
    return selected_rows

df = pd.DataFrame({'A' : [3, 8, 6, 2, 9] , 'B' : [5, 2, 9, 3, 1] , 'C' : [1, 7, 4, 5, 2]})
selected_rows = select_rows(df)
print(selected_rows)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [18]:
# Ans: 9 

def calculate_stats(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std = df['Values'].std()
    
    print('Mean:', mean)
    print('Median:', median)
    print('Standard Deviation:', std)
    
    
# create the DataFrame
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})

calculate_stats(df)

Mean: 30.0
Median: 30.0
Standard Deviation: 15.811388300841896

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [20]:
# Ans: 10
def calculate_moving_average(df):
    
    # create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

df = pd.DataFrame({'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100],
                   'Date': pd.date_range(start='2023-07-07', periods=10, freq='D')})
df = calculate_moving_average(df)
df = pd.DataFrame(df)
df

   Sales       Date  MovingAverage
0     10 2023-07-07           10.0
1     20 2023-07-08           15.0
2     30 2023-07-09           20.0
3     40 2023-07-10           25.0
4     50 2023-07-11           30.0
5     60 2023-07-12           35.0
6     70 2023-07-13           40.0
7     80 2023-07-14           50.0
8     90 2023-07-15           60.0
9    100 2023-07-16           70.0

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values: Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
## Your function should create the following DataFrame:

**Date Weekday**
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
## The function should return the modified DataFrame.

In [21]:
#Ans: 11

def add_weekday_column(df):
    df['Weekday'] = pd.to_datetime(df['Date']).dt.strftime('%A')
    return df

In [23]:
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})
df = add_weekday_column(df)
print(df)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [29]:
date = pd.date_range(start= '2023-01-01' , end = '2023-01-31')
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

# Ans: 13

The first and foremost necessary library that needs to be imported to use the basic functions of pandas is pandas itself.

In [30]:
import pandas as pd